Revit 2026 API

# UpdaterRegistryDisableUpdater Method

---

Disables the updater.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static void DisableUpdater(
	UpdaterId id
)
```
```vb
Public Shared Sub DisableUpdater (
	id As UpdaterId
)
```
```cpp
public:
static void DisableUpdater(
	UpdaterId^ id
)
```
```fsharp
static member DisableUpdater :
        id : UpdaterId -> unit
```

#### Parameters

id UpdaterId
     The updater id.

| Exception | Condition |
| --- | --- |
| ArgumentException | Updater with this Id is not currently registered in Revit. |
| ArgumentNullException | A non-optional argument was null |

#### Reference

UpdaterRegistry Class

Autodesk.Revit.DB Namespace